{"functionality": "This tool, \"Our Catalogue\", provides an API endpoint that allows developers to view the inventory catalogue of cannabis products. This includes information such as inventory quantities, product images, and descriptions. The API is accessed through a GET request and does not require any specific parameters.", "id": 0, "name": "Our Catalogue"}
{"functionality": "The GST tool API allows users to verify GST numbers and retrieve owner details along with turnover information associated with the provided GST number.", "id": 1, "name": "GST"}
{"functionality": "The tool provides a Free Coupon Codes API for websites, specifically targeting Indian webstores. By providing a site ID generated through Cashnjoy.com registration, users can access coupon codes and potentially offer cashbacks.", "id": 2, "name": "/api/vcodes-api.php?siteid={siteid}"}
{"functionality": "TestEndpoint is a tool developed for a prototype queueing app for testing purposes. It provides a GET method to test the API endpoint with a required parameter named 'testparam'. The tool allows users to make test requests to the provided API endpoint with the specified parameter.", "id": 3, "name": "TestEndpoint"}
{"functionality": "The \"Product by ID\" tool fetches detailed information about a single product from AliExpress, including images, videos, and various product data. It allows users to access specific product details using the provided product ID.", "id": 6, "name": "Product by ID"}
{"functionality": "The GET Call tool is used to fetch API results by providing a request ID received in responses. It retrieves information related to the task associated with the provided request ID.", "id": 7, "name": "GET Call"}
{"functionality": "The checkDisposableEmail tool is an API that allows users to verify if an email address is disposable/temporary and potentially associated with spamming or trolling activities. By sending a GET request with the email address as a parameter, the API provides information on the validity of the domain, whether the email is disposable, and other related details.", "id": 8, "name": "checkDisposableEmail"}
{"functionality": "This tool, emailValidation, provides an API endpoint to check the validity of an email address. It can verify if the domain is valid, if the email is disposable, and provides information on the email's status.", "id": 9, "name": "emailValidation"}
{"functionality": "The newlyRegisteredDomains tool provides a REST API to lookup newly registered domains. The API allows users to search for domains based on various parameters such as page, keywords, registered date, and exclude keywords. This tool can be used to monitor and track recently created domains.", "id": 10, "name": "newlyRegisteredDomains"}
{"functionality": "The \"whois\" tool's API allows users to perform WhoIS lookup on a specified domain name to retrieve registration details such as registration date, registrar information, registrant contact details, admin contact information, tech contact details, and more.", "id": 11, "name": "whois"}
{"functionality": "This tool allows users to retrieve a specific shoe item from a collection by providing the ID of the product. By making a GET request to the provided URL with the specific product ID, users can access details such as the name, price, image, description, quantity, and rating of the selected shoe.", "id": 12, "name": "Get a specific item"}
{"functionality": "This tool provides an API endpoint to retrieve a collection of 30 random shoes.", "id": 13, "name": "Get all the shoes"}
{"functionality": "The /v1/{network} tool is a BlockTrail Bitcoin API endpoint that allows developers to access data and perform payments related to Bitcoin for developers, enterprises, and service providers. It provides the functionality to interact with the BlockTrail API by sending GET requests to retrieve information based on the specified network parameter.", "id": 14, "name": "/v1/{network}"}
{"functionality": "The \"Details\" tool allows users to retrieve general information about a creator on Patreon using the creator's ID. The API enables users to fetch details such as the creator's avatar, cover photo, membership counts, pledge currency, and other relevant information.", "id": 16, "name": "Details"}
{"functionality": "This tool allows users to search for creators on Patreon using a specified search query to retrieve details and posts from the platform.", "id": 17, "name": "Search for Creators"}
{"functionality": "This tool allows users to search for products on Shopee by providing a search query and optional pagination. The API returns product details including title, image, price, location, rating, and number of items sold.", "id": 18, "name": "Search products"}
{"functionality": "This tool provides an API that allows users to retrieve detailed information about a specific product listed on the Shopee platform, including attributes, categories, price, stock availability, and description.", "id": 19, "name": "Product details"}
{"functionality": "HaloBiru is an online shop API that allows users to access store information using a GET method request. It provides details about products, categories, and other store-related data. The API can be accessed through a specific URL with the required headers for authentication.", "id": 20, "name": "HaloBiru"}
{"functionality": "This tool, Get Prices, provides an API endpoint to retrieve up-to-date used prices of various GPUs listed on eBay in USD. By accessing the endpoint, users can get pricing information for different GPU models, including minimum, maximum, mean prices, and the number of sales, with the data being automatically refreshed weekly.", "id": 21, "name": "Get Prices"}
{"functionality": "This tool provides an API endpoint named \"getthelistofcountriesregistered\" that allows users to retrieve a list of registered countries on the mktplace.eu platform. It is a GET method that requires the \"action\" parameter set to \"countries\" to fetch the list of countries. The API endpoint returns a JSON response containing the list of registered countries.", "id": 22, "name": "getthelistofcountriesregistered"}
{"functionality": "This tool, listoforders, provides an API endpoint for retrieving a list of orders from the mktplace.eu platform. The API supports a GET request with parameters for action (default is orders_list) and status. The response will include order information in JSON format.", "id": 23, "name": "listoforders"}
{"functionality": "The Profile API provides a way to retrieve user details from a specified endpoint using a GET request. The API requires specific headers for authentication and returns user data in JSON format upon successful retrieval.", "id": 24, "name": "Profile"}
{"functionality": "The Recommendations tool provides an API that allows users to retrieve recommendations related to products, customers, and accounts within a given context. It offers a GET request to receive a list of recommendations by consuming various APIs associated with product, customer, and account data.", "id": 25, "name": "Recommendations"}
